<img src="https://shwetkm.github.io/upxlogo.png"></img>

# Python Advanced - Data Science Foundation

**SET THE WORKING DIRECTORY SO THAT WE DO NOT HAVE TO THINK ABOUT PATH PROBLEMS**

Please ensure all your folder names <font color='red'><b>do not have a space & use forward slash (/)</b></font>

In [ ]:
# Please ensure the path follows the rules we had discussed and ensure a '/' at the last
your_local_path="C:/Users/tejks/Desktop/ML/practice/"

In [ ]:
def func_python(N):
    d=0
    for i in range(N):
        d += (i % 3 - 1) * i
    return d

In [ ]:
%timeit func_python(10000)

In [ ]:
distance = [45,50,35]
speed = [5,10,7]


time = distance/speed 
print (time)

**Introduction to NumPy**

NumPy (short form for Numerical Python) is the most fundamental package designed for scientific computing and data analysis. Most of the other packages such as pandas, statsmodels are built on top of it, and is an important package to know and learn about. At the heart of NumPy is a data structure called **ndarray**. ndarray is a basically a multi-dimensional array that is built specifically for the purpose of numerical data analysis. Python also has array capabilities, but they are more generic. <b>The advantage of using ndarray is that processing is extremely efficient and fast.</b> 

You can perform standard mathematical operations on either individual elements or complete array. The range of functions covered is <b>linear algebra, statistical operations, and other specialized mathematical operations</b>. For our purpose, we need to know about <b>ndarray and the range of mathematical functions that are relevant to our research purpose</b>. If you already know languages such as C, Fortran, then you can integrate NumPy code with code written in these languages and can pass NumPy arrays seamlessly. 

From an overall perspective, understanding of <b>NumPy will help us in using pandas effectively as it is built on top of NumPy and frequently we will also be using functions of NumPy in research work</b>. In the current session, we will only look at some of the most important features of NumPy. For a full listing of NumPy features, please visit http://wiki.scipy.org/Numpy_Example_List .

Possible application of NumPy package in research work are:
<i>
+ Algorithmic operations such as sorting, grouping and set operations
+ Performing repetitive operations on whole arrays of data without using loops
+ Data merging and alignment operations
+ Data indexing, filtering, and transformation on individual elements or whole arrays
+ Data summarization and descriptive statistics
</i>
**Installing NumPy**

In order to check if NumPy is installed, go to Package Manager and type NumPy. You will get a list of packages with names closely matching to NumPy. For our purpose, we need to focus on package named numpy 1.xx. If the package is not installed, click on Install. 

**Importing NumPy**

In order to be able to use NumPy, first import it using import statement

In [ ]:
import numpy as np

The above statement will import all of NumPy into your workspace. For starters its good, but if you are doing performance intensive work, then saving space is of importance. In such cases, you can import specific modules of NumPy by using

In [ ]:
from numpy import array
from numpy import arange

In [ ]:
# How we have overcome the prior challenge using 
dist = array(distance)
spd = np.array(speed)
print (dist)
print (spd)
time= dist/spd
print (time)
len(time)

ndarray
The most important data structure in NumPy is an n-dimensional array object. Using ndarray, you can store large multidimensional datasets in Python. Being an array, you can <b>perform mathematical operations on these arrays either one element at a time or on complete arrays without using loops</b>. The way to initialize an array object is

In [ ]:
a=[1,2,3,4,5]                                 # initialize a list and assign values to it
b=[10,20,30,40,50]
print (a + b)
#print (a + 5)                               #Want to add '5' to all the elements in the list
c = [val + 5 for val in a]           
print (c)

In [ ]:
a = array((1,2,3,4,5))                       # initializes an array a and assigns values to it
b = array((10,20,30,40,50))                  # initializes another array b
#print (a)
#print (b)
print(a+b) 
print (a+5) 
a**2
b**3

In [ ]:
c = array(arange(10))                           #arange function here works as a sequence or counter in increments of 1
print ('array:                ', c)
print()
print()

anarray = array(np.arange(5,56,5))                 #arange function here works as a sequence or counter in increments of 5
print ('anarray:              ', anarray)
print()
print()

onemorearray = array(np.linspace(3.4,4,11.7))           #linspace function here creates 11 evenly spaced numbers over a specified interval
print ('onemorearray:         ', onemorearray)
print ('Rounded onemorearray: ', np.round(onemorearray,0))
onemorearray.sum()

With each ndarray are associated two attributes: shape of the array, and type of the array. The <font color='red'><b>shape</b> of the array tells you about <b><u>dimensionality</u></b> of the array (rows and columns), and <b>type</b> of the array tells you about the <b><u>data type</u></b> contained</font> in the array.

In [ ]:
data = np.array((32,45,123,756,23,2123,1,2,3,4,5,6,6,5,4,3,2,1,78,89,87,76,54,31))
data = data.reshape(8,3)
data2 = data.reshape(2,3,2,2)
print(data)
print ("*****")
print (data2)
print(data2.shape)
print(data2.dtype)
print(data2.size)
#even_data = (data % 2 == 0)
#data[even_data]

In [ ]:
np.zeros(50) + 5                        # Make a 50, 0 numbered single dimensional array

In [ ]:
np.zeros((3,5)) + 6                     # Make a 15, 0 numbered 2 dimensional array

In [ ]:
np.ones(30) + 7                         # Make a 30, 1 numbered single dimensional array

In [ ]:
np.ones((5,9))                       # Make a 45, 1 numbered 2 dimensional array

In [ ]:
np.eye(5)                            # creates a 5*5 identity matrix.

In [ ]:
np.diag(array([1,3,5,3,4,5]))        # Populate the disgonal elements only

**pandas**

Pandas is the primary package for performing data analysis tasks in Python. pandas derives its name from <b>PANel Data AnalysiS</b> and is the fundamental package that provides <b>relational data structures (think Excel, SQL type) and a host of capabilities to play with those data structures</b>. It is the most widely used package in Python for data analysis tasks, and is very good to work with <b>cross sectional, time series, and panel data analysis</b>. Python sits on top of NumPy and can be used with NumPy arrays and the functions in NumPy. How is pandas suited for a researcher’s needs:
<i>
+ Has a tabular data structure that can hold both <b>homogenous and heterogenous data</b>.
+ Very <b>good indexing capabilities</b> that makes data alignment and merging easy.
+ Good <b>time series functionality</b>. No need to use different data structures for time series and cross sectional data. Allows for both <b>ordered and unordered time-series data</b>.
+ A host of <b>statistical functions</b> developed around NumPy and pandas that makes a researcher’s task easy and fast.
+ Programming is lot <b>simpler and faster</b>.
+ Easily handles <b>data manipulation and cleaning</b>.
+ Easy to expand and shorten data sets. <b>Comprehensive merging, joins, and group by functionality to join multiple data sets</b>.
</i>

**Installing pandas** 

In order to check if pandas is installed, go to Package Manager and type pandas. By default, pandas already comes installed with a distribution of Canopy. If the package is not installed, click on Install.

**Importing pandas**

In order to be able to use NumPy, first import it using import statement

In [ ]:
import pandas as pd                         # This will import pandas into your workspace

In [ ]:
import numpy as np                          # We will be using numpy functions so import numpy

**Data Structures in pandas**

There are two basic data structures in pandas: <b><i>Series and DataFrame</i></b>

**Series:** It is similar to a NumPy 1-dimensional array. In addition to the values that are specified by the programmer, <b>pandas attaches a label to each of the values</b>. If the labels are not provided by the programmer, then pandas assigns labels ( 0 for first element, 1 for second element and so on). A benefit of assigning labels to data values is that it becomes easier to perform manipulations on the dataset as the whole dataset becomes more of a dictionary where each value is associated with a label.

In [ ]:
series1 = pd.Series([10,20,30,40])
series1

In [ ]:
series1.values

In [ ]:
series1.index

If you want to specify custom index values rather than the default ones provided, you can do so using the following command

In [ ]:
series2 = pd.Series([10,20,30,40,50], index=['one','two','three','four','five'])
series2

The ways of accesing elements in a Series object are similar to what we have seen in NumPy, and you can perform NumPy operations on Series data arrays.

In [ ]:
series2[2]                  # How to print 30 from the series

In [ ]:
series2['three']            # Another way to print 30 from the series

In [ ]:
series2[['one', 'three', 'five']]

In [ ]:
series2[[0,1,3]]

In [ ]:
series2 + 4            # Add 4 to every element

In [ ]:
series2 ** 3           # Cube every element

In [ ]:
series2[series2>30]    # Find all values greater than 30

In [ ]:
np.sqrt(series2)       # Get the square roots of all the values

If you have a dictionary, you can <b>create a Series data structure from that dictionary</b>. Suppose you are interested in EPS values for firms and the <i>values come from different sources and is not clean. In that case you dont have to worry about cleaning and aligning those values</i>.

In [18]:
years = [90, 91, 92, 93, 94, 95]
f1 = {90:8, 91:9, 92:7, 93:8, 94:9, 95:11, 96:13}
firm1 = pd.Series(f1,index=years)                     # Extra element in VALUE not an issue
firm1

90     8
91     9
92     7
93     8
94     9
95    11
dtype: int64

In [19]:
f2 = {90:14,92:9, 93:13, 94:5}                      
firm2 = pd.Series(f2,index=years)                   # Extra element in the KEY is handled as NaN
firm2

90    14.0
91     NaN
92     9.0
93    13.0
94     5.0
95     NaN
dtype: float64

NaN stands for missing or NA values in pandas. Make use of isnull() function to find out if there are any missing values in the data structure.

In [20]:
pd.isnull(firm2)

90    False
91     True
92    False
93    False
94    False
95     True
dtype: bool

A key feature of Series data is structures is that you don't have to worry about data alignment. For example, if we have run a word count program on two different files and we have the following data structures

In [21]:
dict1 = {'finance': 10, 'earning': 5, 'debt':8}
dict2 = {'finance' : 8, 'compensation':4, 'earning': 9}
count1 = pd.Series(dict1)
count2 = pd.Series(dict2)
print (count1)
print (count2)

debt        8
earning     5
finance    10
dtype: int64
compensation    4
earning         9
finance         8
dtype: int64

If we want to calculate the sum of common words in combined files, then we dont have to worry about data alignment. If we want to include all words, then we can take care of NaN values and compute the sum. By default, Series data structure ignores NaN values. NaN values stand for missing data values.

In [22]:
count1+count2                                # Sum values on key based retrieval. Non matching keys become NaN

compensation     NaN
debt             NaN
earning         14.0
finance         18.0
dtype: float64

**Data Frame**

DataFrame is a <b>tabular data structure</b> in which data is laid out in <b>rows and column</b> format (similar to a CSV and SQL file), but it can also be <b>used for higher dimensional data</b> sets. The DataFrame object can contain homogenous and heterogenous values, and can be thought of as a logical extension of Series data structures. In contrast to <u>Series</u>, where there is <b>one index</b>, a <u>DataFrame</u> object has <b>one index for column and one index for rows</b>. This allows flexibility in accessing and manipulating data.

In [25]:
data = pd.DataFrame({'price':[95, 25, 85, 41, 78],
                     'ticker':['AXP', 'CSCO', 'DIS', 'MSFT', 'WMT'],
                     'company':['American Express', 'Cisco', 'Walt Disney','Microsoft', 'Walmart']})
data

            company  price ticker
0  American Express     95    AXP
1             Cisco     25   CSCO
2       Walt Disney     85    DIS
3         Microsoft     41   MSFT
4           Walmart     78    WMT

If a column is passed with no values, it will simply have NaN values

In order to access a column, simply mention the column name

In [26]:
data['company']                          # Print only company names

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

In [27]:
data.company                            # Another way to print only company names

0    American Express
1               Cisco
2         Walt Disney
3           Microsoft
4             Walmart
Name: company, dtype: object

In [37]:
print (data.ix[2])                              # Print the row corresponding to the given Index

company         Walt Disney
price                    85
ticker                  DIS
Year                   2014
pricesquared            NaN
sequence                  5
Name: 2, dtype: object

In [29]:
data.ix[data.ticker=='DIS']            # Print the row corresponding to the ticker that is 'DIS'

       company  price ticker
2  Walt Disney     85    DIS

In order to add additional columns

In [30]:
data['Year'] = 2014                       # Add additional column Year. Populate value of 2014 in all the rows.
data

            company  price ticker  Year
0  American Express     95    AXP  2014
1             Cisco     25   CSCO  2014
2       Walt Disney     85    DIS  2014
3         Microsoft     41   MSFT  2014
4           Walmart     78    WMT  2014

In [31]:
data['pricesquared'] = data.price**2      # Square all the prices and add another column 'pricesquared'.
data

            company  price ticker  Year  pricesquared
0  American Express     95    AXP  2014          9025
1             Cisco     25   CSCO  2014           625
2       Walt Disney     85    DIS  2014          7225
3         Microsoft     41   MSFT  2014          1681
4           Walmart     78    WMT  2014          6084

In [32]:
del data['pricesquared']                  # Delete column 'pricesquared'
data

            company  price ticker  Year
0  American Express     95    AXP  2014
1             Cisco     25   CSCO  2014
2       Walt Disney     85    DIS  2014
3         Microsoft     41   MSFT  2014
4           Walmart     78    WMT  2014

In [33]:
data['pricesquared'] = np.NaN             # Create column 'pricesquared' with NaN values
data

            company  price ticker  Year  pricesquared
0  American Express     95    AXP  2014           NaN
1             Cisco     25   CSCO  2014           NaN
2       Walt Disney     85    DIS  2014           NaN
3         Microsoft     41   MSFT  2014           NaN
4           Walmart     78    WMT  2014           NaN

In [36]:
data['sequence'] = np.arange(1,10,2)         # Add column 'sequence' and populate sequence of numbers from 1 to 5
data

            company  price ticker  Year  pricesquared  sequence
0  American Express     95    AXP  2014           NaN         1
1             Cisco     25   CSCO  2014           NaN         3
2       Walt Disney     85    DIS  2014           NaN         5
3         Microsoft     41   MSFT  2014           NaN         7
4           Walmart     78    WMT  2014           NaN         9

In [39]:
years = [90, 91, 92, 93, 94, 95]
print('-------------Firm 1------------')
f1 = {90:8, 91:9, 92:7, 93:8, 94:9, 95:11}
firm1 = pd.Series(f1,index=years)
print(firm1)
print('-------------Firm 2------------')
f2 = {90:14,92:9, 93:13, 94:5}
firm2 = pd.Series(f2,index=years)
print(firm2)
print('-------------Firm 3------------')
f3 = {93:10, 94:12, 95: 13}
firm3 = pd.Series(f3,index=years)
print(firm3)
print('-------------Create empty dataframe------------')
df1 = pd.DataFrame(columns=['Firm1','Firm2','Firm3'],index=years)    # Convert the 3 series to a DataFrame with 'years' as Index
print(df1)
print('-------------Populate the dataframe------------')
df1.Firm1 = firm1
df1.Firm2 = firm2
df1.Firm3 = firm3
df1

-------------Firm 1------------
90     8
91     9
92     7
93     8
94     9
95    11
dtype: int64
-------------Firm 2------------
90    14.0
91     NaN
92     9.0
93    13.0
94     5.0
95     NaN
dtype: float64
-------------Firm 3------------
90     NaN
91     NaN
92     NaN
93    10.0
94    12.0
95    13.0
dtype: float64
-------------Create empty dataframe------------
   Firm1 Firm2 Firm3
90   NaN   NaN   NaN
91   NaN   NaN   NaN
92   NaN   NaN   NaN
93   NaN   NaN   NaN
94   NaN   NaN   NaN
95   NaN   NaN   NaN
-------------Populate the dataframe------------

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In [42]:
dft = df1.T         # Transpose the table
dft
#print('-----------------Delete Column = 90--------------------------')
del dft['Firm1']
print(dft)

KeyError: 'Firm1'

You can pass a number of data structures to DataFrame such as a <b>ndarray, lists, dict, Series, and another DataFrame</b>. You can also <b>reindex</b> to confirm to data to a new index. Reindexing is a powerful feature that <b>allows you to access data in a number of different ways</b>, and also to confirm data to some new time series or other index.

In [43]:
print (df1)
reindexdf1 = df1.reindex([88,89,90,91,92,93,94,95,96,97,98])     # No data from 88-89 & from 96-98
reindexdf1

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

    Firm1  Firm2  Firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90    8.0   14.0    NaN
91    9.0    NaN    NaN
92    7.0    9.0    NaN
93    8.0   13.0   10.0
94    9.0    5.0   12.0
95   11.0    NaN   13.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

In [ ]:
print(df1)                                                 # Year from 90 to 95                
reindexdf1 = df1.reindex(np.arange(88,99))             # Make the years more meaningful. Then populate the values separately.
reindexdf1

Similarly, you have backfill (bfill) method to fill values backwards.

In [47]:
reindexdf3 = df1.reindex([88,89,90,91,92,93,94,95,96,97,98], method='bfill') # Forwrd fill the last non-empty row to the left over
reindexdf3

    Firm1  Firm2  Firm3
88    8.0   14.0    NaN
89    8.0   14.0    NaN
90    8.0   14.0    NaN
91    9.0    NaN    NaN
92    7.0    9.0    NaN
93    8.0   13.0   10.0
94    9.0    5.0   12.0
95   11.0    NaN   13.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

In [48]:
reindexdf1+reindexdf3

    Firm1  Firm2  Firm3
88    NaN    NaN    NaN
89    NaN    NaN    NaN
90   16.0   28.0    NaN
91   18.0    NaN    NaN
92   14.0   18.0    NaN
93   16.0   26.0   20.0
94   18.0   10.0   24.0
95   22.0    NaN   26.0
96    NaN    NaN    NaN
97    NaN    NaN    NaN
98    NaN    NaN    NaN

You can use NumPy functions inside DataFrame objects.

In [72]:
dataframe = pd.DataFrame(np.random.randn(3,3),columns=['one','two','three'])  # Create array of 3*3 dimensionality using standard normally distributed random vales
dataframe

        one       two     three
0 -0.191016 -0.632880  0.289838
1  1.391218  1.150496 -0.191967
2 -1.212067  0.941489 -0.815300

In [73]:
np.abs(dataframe)                   # Absolute value

        one       two     three
0  0.191016  0.632880  0.289838
1  1.391218  1.150496  0.191967
2  1.212067  0.941489  0.815300

In [75]:
f = lambda x:x.max()-x.min()        # We have option to use a powerful lambda function feature. Get the range in a column
abs(dataframe).apply(f)

one      1.200202
two      0.517615
three    0.623332
dtype: float64

In [76]:
abs(dataframe).apply(f,axis=1)           # Apply lambda function on the row and not column as we did in the previous example

0    0.441864
1    1.199251
2    0.396767
dtype: float64

In [78]:
print(abs(dataframe))
g = lambda x: x - np.mean()        
abs(dataframe).apply(g)

        one       two     three
0  0.191016  0.632880  0.289838
1  1.391218  1.150496  0.191967
2  1.212067  0.941489  0.815300

        one       two     three
0 -0.740417 -0.275408 -0.142530
1  0.459785  0.242207 -0.240401
2  0.280633  0.033201  0.382931

In [80]:
def f(x):
    return pd.Series([np.mean(x), x.max(), x.min()], index=['mean','max','min'])
print(dataframe)
dataframe.apply(f,axis=1)

        one       two     three
0 -0.191016 -0.632880  0.289838
1  1.391218  1.150496 -0.191967
2 -1.212067  0.941489 -0.815300

       mean       max       min
0 -0.178019  0.289838 -0.632880
1  0.783249  1.391218 -0.191967
2 -0.361959  0.941489 -1.212067

In [83]:
dataframe = pd.DataFrame(np.random.randn(3,3),columns=['one','two','three'])
abs(dataframe)

        one       two     three
0  0.724883  1.707433  0.844070
1  1.022543  0.902297  0.275956
2  0.257568  0.870329  1.111608

In [84]:
print(abs(dataframe).sort_index(by='one'))    # Sort by column 'one'

        one       two     three
2  0.257568  0.870329  1.111608
0  0.724883  1.707433  0.844070
1  1.022543  0.902297  0.275956

C:\Users\tejks\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

In [86]:
abs(dataframe).sort_index(by=['one','two'])   # Sort first by column 'one' then by column 'two'

C:\Users\tejks\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

        one       two     three
2  0.257568  0.870329  1.111608
0  0.724883  1.707433  0.844070
1  1.022543  0.902297  0.275956

In [87]:
dataframe.sum()                          # Column wise sum

one     -0.555227
two     -1.675464
three    1.679722
dtype: float64

In [88]:
dataframe.sum(axis=1)                    # Row wise sum

0   -0.138479
1   -0.396201
2   -0.016288
dtype: float64

In [89]:
print(dataframe)
dataframe.cumsum()                 # Get cumulative sum

        one       two     three
0  0.724883 -1.707433  0.844070
1 -1.022543  0.902297 -0.275956
2 -0.257568 -0.870329  1.111608

        one       two     three
0  0.724883 -0.982550 -0.138479
1 -1.022543 -0.120245 -0.396201
2 -0.257568 -1.127896 -0.016288

In [90]:
dataframe.describe()

            one       two     three
count  3.000000  3.000000  3.000000
mean  -0.185076 -0.558488  0.559907
std    0.875965  1.332519  0.736135
min   -1.022543 -1.707433 -0.275956
25%   -0.640055 -1.288881  0.284057
50%   -0.257568 -0.870329  0.844070
75%    0.233658  0.015984  0.977839
max    0.724883  0.902297  1.111608

If you have non-numeric data, then applying describe function would produce statistics such as <b>count, unique, frequency</b>. In addition to this, you can also calculate <b>skewness (skew), kurtosis (kurt), percent changes, difference, and other statistics</b>.

**Missing Data**

Pandas have a number of features to deal with <b>missing data</b>. We have seen an example of the case of descriptive statistics, where missing values are not taken into account while calculating the descriptive statistics. Missing data is denoted by NaN.

In [49]:
years = [90, 91, 92, 93, 94, 95]
f1 = {90:8, 91:9, 92:7, 93:8, 94:9, 95:11}
firm1 = pd.Series(f1,index=years)
firm1
f2 = {90:14,92:9, 93:13, 94:5}
firm2 = pd.Series(f2,index=years)
firm2
f3 = {93:10, 94:12, 95: 13}
firm3 = pd.Series(f3,index=years)
firm3
df3 = pd.DataFrame(columns=['Firm1','Firm2','Firm3'],index=years)
df3
df3.Firm1 = firm1
df3.Firm2 = firm2
df3.Firm3 = firm3
df3

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In [51]:
firm2

90    14.0
91     NaN
92     9.0
93    13.0
94     5.0
95     NaN
dtype: float64

In [50]:
nadeleted = firm2.dropna()
nadeleted

90    14.0
92     9.0
93    13.0
94     5.0
dtype: float64

In [52]:
df3

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In case of DataFrame, <b>if you use dropna, it deletes entire row by default</b>. Another way is to drop only <b>those rows that are all NA</b>. If you want to <b>drop columns, pass axis=1</b>

In [55]:
cleandf3 = df3.dropna(axis=1)          # Drop row if any value in the row is NaN
cleandf3

    Firm1
90      8
91      9
92      7
93      8
94      9
95     11

In [56]:
df3

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In [57]:
clean2 = df3.dropna(how='all')   # Drop row if all values in the row are NaN
clean2

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In [ ]:
columndrop = df3.dropna(axis=1)   # Drop column if any value in the column is NaN
columndrop

In [58]:
df3

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In [62]:
thresholddf = df3.dropna(axis=1,thresh=2)    # Define threshold. In this case row having >= 2 NaN, drop the row
thresholddf

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In [63]:
fillna1 = df3.fillna(0)      # Fill all NaN values with 0
fillna1

    Firm1  Firm2  Firm3
90      8   14.0    0.0
91      9    0.0    0.0
92      7    9.0    0.0
93      8   13.0   10.0
94      9    5.0   12.0
95     11    0.0   13.0

In [64]:
fillna2 = df3.fillna({'Firm1':8, 'Firm2': 10, 'Firm3':14})   # We can specify what value should be replaced
fillna2

    Firm1  Firm2  Firm3
90      8   14.0   14.0
91      9   10.0   14.0
92      7    9.0   14.0
93      8   13.0   10.0
94      9    5.0   12.0
95     11   10.0   13.0

In [68]:
df3

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In [69]:
fillna3 = df3.fillna(method='ffill')    # Forward fill NaNs for 1 level. Check Firm 2 -> 14 & 5
fillna3

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9   14.0    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    5.0   13.0

In [71]:
fillna4 = df3.fillna(method='bfill')    # Back fill NaNs till 2 levels before. Check how Firm3 behaves
fillna4

    Firm1  Firm2  Firm3
90      8   14.0   10.0
91      9    9.0   10.0
92      7    9.0   10.0
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

In [66]:
#print(df3.mean())
print (df3)
fillna5 = df3.fillna(df3.mean())  # We will substitute empty values with Mean of the Firm in concern
fillna5

    Firm1  Firm2  Firm3
90      8   14.0    NaN
91      9    NaN    NaN
92      7    9.0    NaN
93      8   13.0   10.0
94      9    5.0   12.0
95     11    NaN   13.0

    Firm1  Firm2      Firm3
90      8  14.00  11.666667
91      9  10.25  11.666667
92      7   9.00  11.666667
93      8  13.00  10.000000
94      9   5.00  12.000000
95     11  10.25  13.000000

**IO in pandas**

In this section, we will focus on <b>I/O from text files, csv, excel, and sql files as well as getting data from web such as Yahoo! Finance</b>. Using functions in pandas, you can read data as a DataFrame object. 

**Reading a csv file**

In [ ]:
roedatacsv = pd.read_csv(your_local_path+'roedata.csv')
#roedatacsv
roedatacsv.head()

If the file does not have a header, then you can either let pandas assign default headers or you can specify custom headers. If you want industry name to be the index of DataFrame, you can achieve that.

In [ ]:
roedatacsv = pd.read_csv(your_local_path+'roedata.csv', index_col = 'Industry Name' )
roedatacsv.head()

In [ ]:
roedatacsv = pd.read_csv(your_local_path+'roedata.csv', usecols = ['Industry Name','ROE'] ) # Prints on columns that we Use here
roedatacsv.head()

In [ ]:
capm_dem_data = pd.read_table(your_local_path+'capm_dem.dat', delimiter=' ',header = None)
capm_dem_data.head()

In [ ]:
compustatdata = pd.read_csv(your_local_path+'compustat.csv', index_col = ['ggroup','gvkey'] )
compustatdata = compustatdata.sort_index(0,ascending=False)
compustatdata.head()

In [ ]:
crsp_data = pd.read_table(your_local_path+'crsp.output', sep='\s+',header = None)
crsp_data.head()

** Handling missing values**

Some types of missing values are automatically identified by pandas as NaN while importing the data. Those types are NA, NULL, -1.#IND. Additionally, you can also specify a list of missing values.

In [ ]:
roemissing = pd.read_csv(your_local_path+'roemissing.csv', na_values=['Null',-999] )
roemissing

In [ ]:
roemissing = pd.read_csv(your_local_path+'roemissing.csv', na_values={'Number of firms':['NULL',-999],'ROE':['10000.00%']} )
roemissing

**Writing Data**

In [ ]:
roedata = pd.read_csv(your_local_path+'roedata.csv')
roedata.to_csv(your_local_path+'roedatawrite.csv')

In [ ]:
roedata = pd.read_csv(your_local_path+'roedata.csv')
roedata.to_csv(your_local_path+'roedatawrite2.csv', index=False, columns=['Industry Name','ROE']) # Index = 'False' & select your own columns

**Merging Data**
<p/>Resembles Joins in database

In [ ]:
import pandas as pd

In [ ]:
left_frame = pd.DataFrame({'key': range(5), 
                           'left_value': ['a', 'b', 'c', 'd', 'e']})
right_frame = pd.DataFrame({'key': range(2, 7), 
                           'right_value': ['f', 'g', 'h', 'i', 'j']})
print(left_frame)
print('\n')
print(right_frame)

In [ ]:
pd.merge(left_frame, right_frame, on='key', how='inner')

In [ ]:
pd.merge(left_frame, right_frame, on='key', how='left')

In [ ]:
pd.merge(left_frame, right_frame, on='key', how='right')

In [ ]:
pd.merge(left_frame, right_frame, on='key', how='outer')

In [ ]:
pd.concat([left_frame, right_frame])

In [ ]:
pd.concat([left_frame, right_frame], axis=1)